sdaiCreateEmptyADB
\details
Creates an empty attribute data block (ADB) instance.
\returns An identifier of the created ADB if it was successfully created; otherwise, the function returns the NULL value.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiVT_NVLD - Value type invalid.
* sdaiSY_ERR - Underlying system error.
\code
SdaiADB adb = sdaiCreateEmptyADB();
...
sdaiDeleteADB(adb);